Repository: lordvidex/TaskMeter
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Task groups
ru: Группы задач

source: progress
ru: прогресс

# emptyTaskGroupText
source: Task group list is empty
ru: список групп задач пуст

source: Click on
ru: Нажми на

source: to add new Task group
ru: чтобы добавить новую группу задач

source: Delete
ru: Удалить

source: General Settings
ru: Общие Настройки

source: Short break duration
ru: Время короткого перерыва

source: Long break duration
ru: Время длинного перерыва

source: Long break after
ru: Длинный перерыв после

source: Language
ru: Язык

source: App Theme
ru: Тема приложения

source: System
ru: Системы

source: Theme
ru: Тема

source: Select Theme
ru: Выбрайте Тема

source: Data not saved!
ru: Данные не сохранены!

# dataNotSavedDesc1
source: You have some unsaved data, go back and click
ru: У вас есть некоторые несохраненные данные, вернитесь назад и нажмите

# dataNotSavedDesc2
source: at the top-right to save!
ru: в правом верхнем углу сохранить!

source: Discard
ru: Отбросить

source: Cancel
ru: Отменить

# intervals
source: {x,plural, =1{{x} interval}few{{x} intervals}other{{x} intervals}}
ru: {x,plural, =1{{x} интервал}few{{x} интервала}other{{x} интервалы}}

# themeType
source: {theme,select, Dark{Dark}Light{Light}System{System}}
ru: {theme,select, Dark{Тёмная}Light{Светлая}System{Системная}}

# taskCount
source: {x,plural, =0{{x} tasks}=1{{x} task}few{{x} tasks}other{{x} tasks}}
ru: {x,plural, =0{{x} задач}=1{{x} задача}few{{x} задачи}other{{x} задачи}}

source: Create task group
ru: Создайте группа задачи

source: Duration
ru: Время

source: Add task
ru: Добавьте задачу

source: Create
ru: Создать

source: Click
ru: Нажмите

source: Short break
ru: Маленький перерыв

source: Long break
ru: Большой перерыв

# toAddNewTask
source: to add a new task
ru: чтобы добавить новую задачу

source: Task group name
ru: Название группы задач

# taskGroupNameErrorText
source: Enter a valid task group name
ru: Введите правильное название задачи

# hours
source: {hours,plural, =0{}=1{{hours} Hour }few{{hours} Hours }other{{hours} Hours }}
ru: {hours,plural, =0{}=1{{hours} Час }few{{hours} Часа }other{{hours} Часов }}

# minutes
source: {minutes,plural, =0{{minutes} minutes }=1{{minutes} minute }few{{minutes} minutes }other{{minutes} minutes }}
ru: {minutes,plural, =0{{minutes} минут }=1{{minutes} минута }few{{minutes} минуты }other{{minutes} минут }}

# seconds
source: {seconds,plural, =0{}=1{{seconds} second}few{{seconds} seconds}other{{seconds} seconds}}
ru: {seconds,plural, =0{}=1{{seconds} Секунда}few{{seconds} Секунды}other{{seconds} Секунд}}

source: Task name
ru: Название задачи

source: Difficulty
ru: Cложность

source: Type task name...
ru: Введите задачу...

source: Add
ru: Добавьте

source: Edit
ru: Изменить

source: Enter task name
ru: Введите название задачи

source: min.
ru: мин.
